<a href="https://colab.research.google.com/github/unknown-jun/Basic_of_Python/blob/master/Pandas_Functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# 데이터 프레임 만들기

- 문법:  
~~~
변수명 = pd.DataFrame(
    { '컬럼명1' : ['데이터1', '데이터2'], 
      '컬럼명2' : ['데이터'] }
                             )
~~~

In [2]:
data_frame = pd.DataFrame(
    { 'name' : ['John', 'Jenny', 'Nate', 'Julia', 'Brian', 'Chris'],
      'age'  : [20, 30, 30, 40, 45, 25],
      'job'  : ['student', 'developer', 'teacher', 'dentist', 'manager', 'intern'] }
                          )

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
data_frame.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [5]:
data_frame.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 시리즈란
- Dataframe의 구성요소
- Serise가 모여서 Dataframe을 만듦

In [6]:
type(data_frame.age)

pandas.core.series.Series

In [7]:
list_tmp = [1,2,3]

In [8]:
a1 = pd.core.series.Series( [1,2,3] )

In [9]:
a2 = pd.core.series.Series( ['one', 'two', 'three'] )

In [10]:
a3=pd.DataFrame( data = dict(name=a1, word=a2) )
a3

   name   word
0     1    one
1     2    two
2     3  three

# 파일에서 데이터 불러오기

In [17]:
df = pd.read_csv('friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [18]:
df = pd.read_csv('friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df = pd.read_csv('friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [20]:
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [21]:
df = pd.read_csv('friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [22]:
df = pd.read_csv('friend_list_no_head.csv', header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [23]:
df.columns = ['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [24]:
df = pd.read_csv('friend_list_no_head.csv', 
                 header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 데이터 프레임 생성하기

In [25]:
friend_dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]

In [26]:
df=pd.DataFrame(friend_dict_list)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [27]:
df=df[['name', 'job', 'age']]
df.head()

   name      job  age
0  John  student   25
1  Nate  teacher   30

In [28]:
from collections import OrderedDict

In [29]:
friend_ordered_dict = OrderedDict(
    [
     ('name',['John', 'Nate']),
     ('age',[25, 30]),
     ('job',['student', 'teacher'])
    ]
)

In [30]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [31]:
friend_list = [
    ['Johb', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [32]:
column_name = ['name', 'age', 'job']

df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  Johb   20  student
1  Nate   30  teacher

# 데이터 프레임 파일로 저장하기 (to_csv)

In [70]:
friends = [
    {'name':'Jone', 'age':20, 'job':'student'},
    {'name':'Jenny', 'age':30, 'job':None},
    {'name':'Nate', 'age':30, 'job':'teacher'}
    ]
df = pd.DataFrame(friends)
df=df[['name', 'age', 'job']]

In [71]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [66]:
df.to_csv('friends.csv', index=False, header=True)

In [67]:
df=pd.read_csv("friends.csv")
df

    name  age      job
0   Jone   20  student
1  Jenny   30      NaN
2   Nate   30  teacher

In [68]:
df.to_csv('friends.csv', index=True)

In [69]:
df=pd.read_csv("friends.csv")
df

   Unnamed: 0   name  age      job
0           0   Jone   20  student
1           1  Jenny   30      NaN
2           2   Nate   30  teacher

In [74]:
df.to_csv('friends.csv', index=False, header=False)

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [76]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [78]:
df.to_csv('friends.csv', index=False, header=False, na_rep='-')

In [79]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

# 데이터프레임 행, 열 선택 및 필터하기

In [91]:
df = pd.DataFrame(
    {'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': ['student', 'developer', 'teacher']}
)

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [92]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [93]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

앞의 df[1:3]이 적용되지 않았다  
이를 적용하기 위해선

In [94]:
df = df[1:3]
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [99]:
df = pd.DataFrame(
    {'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': ['student', 'developer', 'teacher']}
)

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [100]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [101]:
df = df.loc[[0,2]]
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [102]:
df = pd.DataFrame(
    {'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': ['student', 'developer', 'teacher']}
)

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

##by column condition

In [103]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [105]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [106]:
df[(df.age>25) & (df.name =='Nate')]

   name  age      job
2  Nate   30  teacher

##Filter column

by index

In [108]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [109]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [110]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [112]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [113]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [115]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [116]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [117]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [119]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

# 행, 열 생성 및 수정하기

- 열 생성: df [ '컬럼명' ] = 값
- 조건을 줘서 수정: df [ '컬럼명' ] = np.where( df [ '컬럼명' ] != '조건', '변경 후', '변경 전' )

In [34]:
friend_dict_list = [
        {'name':'John', 'age':15, 'job':'student'},
        {'name':'Jenny', 'age':30, 'job':'developer'},
        {'name':'Nate', 'age':30, 'job':'teacher'}
                    ]
                    
df = pd.DataFrame(friend_dict_list, columns=['name', 'age', 'job'])

In [35]:
df.head()

    name  age        job
0   John   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [36]:
df['salary'] = 0

In [37]:
df.head()

    name  age        job  salary
0   John   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [38]:
df['salary']=np.where(df['job'] != 'student', 'yes', 'no')

In [39]:
df.head()

    name  age        job salary
0   John   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [40]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                    {'name':'Jenny', 'midterm':85, 'final':80},
                    {'name':'Nate', 'midterm':30, 'final':10}]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [41]:
df['total'] = df['midterm'] + df['final']
df.head()

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [42]:
df['average'] = df['total']/2
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [43]:
grades = [ ]

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

df['grade'] = grades

df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [44]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

df['grade'] = df['grade'].apply(pass_or_fail)
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [45]:
date_list = [
    {
        'yyyy-mm-dd':'2000-06-27'
    },
    
    {
        'yyyy-mm-dd':'2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])

df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [46]:
def extract_year(row):
    return row.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year)

df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [47]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                    {'name':'Jenny', 'midterm':85, 'final':80},
                    {'name':'Nate', 'midterm':30, 'final':10}]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [48]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final'])
df2.head()

  name  midterm  final
0  Ben       50     50

In [49]:
df.append(df2, ignore_index = True)
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10